Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32756G-EVAL.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                                |I2C1|I2C2|I2C3|I2C4|SPI1 |SPI2 |SPI3 |SPI4 |SPI5 |SPI6 |USART1|USART2|USART3|USART6|ADC1 |TIM (PWM)                                 |USB       |RCC       |SYS        
PA0 , // |SAI2_SDB [WM8994ECS/R_DACDATA1]            |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN0 |+TIM2_CH1 *TIM5_CH1                       |          |          |           
PA1 , // |MII_RX_CLK [DP83848CVV_RX_CLK]             |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN1 |+TIM2_CH2 *TIM5_CH2                       |          |          |           
PA2 , // |SAI2_SCKB [WM8994ECS/R_BCLK1]              |    |    |    |    |     |     |     |     |     |     |      |+TX   |      |      |*IN2 |+TIM9_CH1 *TIM2_CH3 +TIM5_CH3             |          |          |           
PA3 , // |ULPI_D0 [USB3300-EZK_D0]                   |    |    |    |    |     |     |     |     |     |     |      |+RX   |      |      |*IN3 |*TIM2_CH4 +TIM5_CH4 +TIM9_CH2             |          |          |           
PA4 , // |                                           |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN4 |                                          |          |          |           
PA5 , // |ULPI_CK [USB3300-EZK_CLKOUT]               |    |    |    |    |+SCK |     |     |     |     |     |      |      |      |      |*IN5 |+TIM8_CH1N +TIM2_CH1                      |          |          |           
PA6 , // |                                           |    |    |    |    |+MISO|     |     |     |     |     |      |      |      |      |*IN6 |+TIM3_CH1 +TIM13_CH1                      |          |          |           
PA7 , // |MII_RX_DV [DP83848CVV_RX_CLK]              |    |    |    |    |+MOSI|     |     |     |     |     |      |      |      |      |*IN7 |+TIM8_CH1N +TIM14_CH1 +TIM3_CH2 +TIM1_CH1N|          |          |           
PA8 , // |MII_MCO [DP83848CVV_X1]                    |    |    |*SCL|    |     |     |     |     |     |     |      |      |      |      |     |*TIM1_CH1                                 |          |          |           
PA9 , // |RS232/IrDA_TX [ST3241EBPR_T2IN]            |    |    |    |    |     |+SCK |     |     |     |     |+TX   |      |      |      |     |*TIM1_CH2                                 |          |          |           
PA10, // |RS232/IrDA_RX [ST3241EBPR_R3OUT]           |    |    |    |    |     |     |     |     |     |     |+RX   |      |      |      |     |*TIM1_CH3                                 |          |          |           
PA11, // |USB_FS1_DM                                 |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM1_CH4                                 |*OTG_FS_DM|          |           
PA12, // |USB_FS1_DP                                 |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |*OTG_FS_DP|          |           
PA13, // |TMS/SWDIO                                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |*JTMS-SWDIO
PA14, // |TCK/SWCLK                                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |*JTCK-SWCLK
PA15, // |TDI                                        |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM2_CH1                                 |          |          |*JTDI      
PB0 , // |ULPI_D1 [USB3300-EZK_D1]                   |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN8 |+TIM8_CH2N +TIM3_CH3 *TIM1_CH2N           |          |          |           
PB1 , // |ULPI_D2 [USB3300-EZK_D2]                   |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN9 |+TIM3_CH4 *TIM1_CH3N +TIM8_CH3N           |          |          |           
PB2 , // |QSPI_CLK [MT25QL512ABA8ESF_CLK]            |    |    |    |    |     |     |+MOSI|     |     |     |      |      |      |      |     |                                          |          |          |           
PB3 , // |TDO/SWO                                    |    |    |    |    |*SCK |     |*SCK |     |     |     |      |      |      |      |     |*TIM2_CH2                                 |          |          |*JTDO-SWO  
PB4 , // |TRST                                       |    |    |    |    |*MISO|     |*MISO|     |     |     |      |      |      |      |     |*TIM3_CH1                                 |          |          |*JTRST     
PB5 , // |ULPI_D7 [USB3300-EZK_D7]                   |    |    |    |    |*MOSI|     |*MOSI|     |     |     |      |      |      |      |     |*TIM3_CH2                                 |          |          |           
PB6 , // |QSPI_BK1_NCS [MT25QL512ABA8ESF-0SIT_CS]    |+SCL|    |    |    |     |     |     |     |     |     |*TX   |      |      |      |     |*TIM4_CH1                                 |          |          |           
PB7 , // |LED3 (Red)                                 |+SDA|    |    |    |     |     |     |     |     |     |*RX   |      |      |      |     |*TIM4_CH2                                 |          |          |           
PB8 , // |I2C1_SCL [WM8994ECS/R_SCLK]                |*SCL|    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM10_CH1 *TIM4_CH3                      |          |          |           
PB9 , // |I2C1_SDA [WM8994ECS/R_SDA]                 |*SDA|    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM11_CH1 *TIM4_CH4                      |          |          |           
PB10, // |ULPI_D3 [USB3300-EZK_D3]                   |    |+SCL|    |    |     |+SCK |     |     |     |     |      |      |+TX   |      |     |+TIM2_CH3                                 |          |          |           
PB11, // |ULPI_D4 [USB3300-EZK_D4]                   |    |+SDA|    |    |     |     |     |     |     |     |      |      |+RX   |      |     |+TIM2_CH4                                 |          |          |           
PB12, // |ULPI_D5 [USB3300-EZK_D5]                   |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PB13, // |ULPI_D6 [USB3300-EZK_D6]                   |    |    |    |    |     |+SCK |     |     |     |     |      |      |      |      |     |*TIM1_CH1N                                |          |          |           
PB14, // |USB_FS2_DM                                 |    |    |    |    |     |+MISO|     |     |     |     |      |      |      |      |     |+TIM12_CH1 +TIM8_CH2N +TIM1_CH2N          |*OTG_HS_DM|          |           
PB15, // |USB_FS2_DP                                 |    |    |    |    |     |+MOSI|     |     |     |     |      |      |      |      |     |+TIM12_CH2 +TIM1_CH3N +TIM8_CH3N          |*OTG_HS_DP|          |           
PC0 , // |ULPI_STP [USB3300-EZK_STP]                 |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN10|                                          |          |          |           
PC1 , // |SAI1_SDA [WM8994ECS/R_ADCDAT1]             |    |    |    |    |     |+MOSI|     |     |     |     |      |      |      |      |*IN11|                                          |          |          |+TRACED0   
PC2 , // |MII_TXD2 [DP83848CVV_TXD_2]                |    |    |    |    |     |+MISO|     |     |     |     |      |      |      |      |*IN12|                                          |          |          |           
PC3 , // |MII_TX_CLK [DP83848CVV_TX_CLK]             |    |    |    |    |     |+MOSI|     |     |     |     |      |      |      |      |*IN13|                                          |          |          |           
PC4 , // |MII_RXD0 [DP83848CVV_RXD_0/PHYAD1]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN14|                                          |          |          |           
PC5 , // |MII_RXD1 [DP83848CVV_RXD_1/PHYAD2]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN15|                                          |          |          |           
PC6 , // |I2S3_CK                                    |    |    |    |    |     |     |     |     |     |     |      |      |      |+TX   |     |+TIM8_CH1 +TIM3_CH1                       |          |          |           
PC7 , // |MIC_CK [MP34DT01TR_CLK]                    |    |    |    |    |     |     |     |     |     |     |      |      |      |+RX   |     |+TIM8_CH2 +TIM3_CH2                       |          |          |           
PC8 , // |uSD_D0 [SMS064FF_7]                        |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM3_CH3 +TIM8_CH3                       |          |          |+TRACED1   
PC9 , // |uSD_D1 [SMS064FF_8]                        |    |    |*SDA|    |     |     |     |     |     |     |      |      |      |      |     |+TIM8_CH4 *TIM3_CH4                       |          |          |           
PC10, // |uSD_D2 [SMS064FF_1]                        |    |    |    |    |     |     |+SCK |     |     |     |      |      |*TX   |      |     |                                          |          |          |           
PC11, // |uSD_D3 [SMS064FF_2]                        |    |    |    |    |     |     |+MISO|     |     |     |      |      |*RX   |      |     |                                          |          |          |           
PC12, // |uSD_CLK [SMS064FF_5]                       |    |    |    |    |     |     |+MOSI|     |     |     |      |      |      |      |     |                                          |          |          |*TRACED3   
PC13, // |TAMPER_WKUP_KEY [B2]                       |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PC14, // |OSC32_IN                                   |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |*OSC32_IN |           
PC15, // |OSC32_OUT                                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |*OSC32_OUT|           
PD0 , // |D2[IS61WV102416BLL_I/OD2]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD1 , // |D3 [IS61WV102416BLL_I/O3]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD2 , // |uSD_CMD [SMS064FF_3]                       |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |+TRACED2   
PD3 , // |                                           |    |    |    |    |     |*SCK |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD4 , // |FMC_NOE [IS61WV102416BLL_OE]               |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD5 , // |FMC_NWE [IS61WV102416BLL_WE]               |    |    |    |    |     |     |     |     |     |     |      |*TX   |      |      |     |                                          |          |          |           
PD6 , // |FMC_NWAIT [PC28F128M29EWLA_RB]             |    |    |    |    |     |     |+MOSI|     |     |     |      |*RX   |      |      |     |                                          |          |          |           
PD7 , // |FMC_NE1 [PC28F128M29EWLA_E]                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD8 , // |D13 [IS61WV102416BLL_I/O13]                |    |    |    |    |     |     |     |     |     |     |      |      |+TX   |      |     |                                          |          |          |           
PD9 , // |D14 [IS61WV102416BLL_I/O14]                |    |    |    |    |     |     |     |     |     |     |      |      |+RX   |      |     |                                          |          |          |           
PD10, // |D15 [IS61WV102416BLL_I/O15]                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD11, // |A16 [IS61WV102416BLL_A16]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD12, // |A17 [IS61WV102416BLL_A17]                  |    |    |    |*SCL|     |     |     |     |     |     |      |      |      |      |     |+LPTIM1_IN1 +TIM4_CH1                     |          |          |           
PD13, // |A18 [IS61WV102416BLL_A18]                  |    |    |    |+SDA|     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH2                                 |          |          |           
PD14, // |D0 [IS61WV102416BLL_I/O0]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH3                                 |          |          |           
PD15, // |D1 [IS61WV102416BLL_I/O1]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH4                                 |          |          |           
PE0 , // |FMC_NBL0 [IS61WV102416BLL_BLE]             |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PE1 , // |FMC_NBL1 [IS61WV102416BLL_BHE]             |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*LPTIM1_IN2                               |          |          |           
PE2 , // |A23 [PC28F128M29EWLA_A23]                  |    |    |    |    |     |     |     |*SCK |     |     |      |      |      |      |     |                                          |          |          |*TRACECLK  
PE3 , // |A19 [IS61WV102416BLL_A19]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |*TRACED0   
PE4 , // |A20 [IS61WV102416BLL_A20                   |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |*TRACED1   
PE5 , // |A21 [PC28F128M29EWLA_A21]                  |    |    |    |    |     |     |     |*MISO|     |     |      |      |      |      |     |*TIM9_CH1                                 |          |          |*TRACED2   
PE6 , // |A22 [PC28F128M29EWLA_A22]                  |    |    |    |    |     |     |     |*MOSI|     |     |      |      |      |      |     |*TIM9_CH2                                 |          |          |+TRACED3   
PE7 , // |D4 [IS61WV102416BLL_I/O4]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PE8 , // |D5 [IS61WV102416BLL_I/O5]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |          |           
PE9 , // |D6 [IS61WV102416BLL_I/O6]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1                                 |          |          |           
PE10, // |D7 [IS61WV102416BLL_I/O7]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH2N                                |          |          |           
PE11, // |D8 [IS61WV102416BLL_I/O8]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH2                                 |          |          |           
PE12, // |D9 [IS61WV102416BLL_I/O9]                  |    |    |    |    |     |     |     |+SCK |     |     |      |      |      |      |     |+TIM1_CH3N                                |          |          |           
PE13, // |D10 [IS61WV102416BLL_I/O10]                |    |    |    |    |     |     |     |+MISO|     |     |      |      |      |      |     |+TIM1_CH3                                 |          |          |           
PE14, // |D11 [IS61WV102416BLL_I/O11]                |    |    |    |    |     |     |     |+MOSI|     |     |      |      |      |      |     |+TIM1_CH4                                 |          |          |           
PE15, // |D12 [IS61WV102416BLL_I/O12]                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF0 , // |A0 [IS61WV102416BLL_A0]                    |    |*SDA|    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF1 , // |A1 [IS61WV102416BLL_A1]                    |    |*SCL|    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF2 , // |A2 [IS61WV102416BLL_A2]                    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF3 , // |A3 [IS61WV102416BLL_A3]                    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF4 , // |A4 [IS61WV102416BLL_A4]                    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF5 , // |A5 [IS61WV102416BLL_A5]                    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF6 , // |QSPI_BK1_IO3 [MT25QL512ABA8ESF_HOLD\#/DQ3] |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM10_CH1                                |          |          |           
PF7 , // |QSPI_BK1_IO2 [MT25QL512ABA8ESF_W\#/Vpp/DQ2]|    |    |    |    |     |     |     |     |*SCK |     |      |      |      |      |     |+TIM11_CH1                                |          |          |           
PF8 , // |QSPI_BK1_IO0 [MT25QL512ABA8ESF_DQ0]        |    |    |    |    |     |     |     |     |*MISO|     |      |      |      |      |     |*TIM13_CH1                                |          |          |           
PF9 , // |QSPI_BK1_IO1 [MT25QL512ABA8ESF_DQ1]        |    |    |    |    |     |     |     |     |*MOSI|     |      |      |      |      |     |*TIM14_CH1                                |          |          |           
PF10, // |LED1 (Green)                               |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF11, // |SDNRAS [IS42S32800G_RAS]                   |    |    |    |    |     |     |     |     |+MOSI|     |      |      |      |      |     |                                          |          |          |           
PF12, // |A6 [IS61WV102416BLL_A6]                    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF13, // |A7 [IS61WV102416BLL_A7]                    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF14, // |A8 [IS61WV102416BLL_A8]                    |    |    |    |+SCL|     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF15, // |A9 [IS61WV102416BLL_A9]                    |    |    |    |*SDA|     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG0 , // |A10 [IS61WV102416BLL_A10]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG1 , // |A11 [IS61WV102416BLL_A11]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG2 , // |A12 [IS61WV102416BLL_A12]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG3 , // |A13 [IS61WV102416BLL_A13]                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG4 , // |                                           |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG5 , // |                                           |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG6 , // |MII_MDIO_GPIO [DP83848CVV_MDIO]            |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG7 , // |MII_MDC_GPIO [DP83848CVV_MDC]              |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG8 , // |SDCLK [IS42S32800G_CLK]                    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG9 , // |SAI2_FSB [WM8994ECS/R_LRCLK1]              |    |    |    |    |     |     |     |     |     |     |      |      |      |*RX   |     |                                          |          |          |           
PG10, // |FMC_NE3 [IS61WV102416BLL_CSE]              |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
